[{"jobText":"
Data Scientist
Digital Technologies Research Centre
Ottawa - Ontario

RCO

These are two three year term positions with possibility of extension.
Assignments and secondments may be considered according to NRC's policies.
An eligibility list may be established for similar positions for a one year period.
Your challenge
Help bring research to life and drive your career forward with the National Research Council of Canada (NRC), Canada's premier research and technology organization.

We are looking for:

talented Data Scientists to join our growing data analytics team; 
enthusiastic people to work on statistics and predictive analytics projects across a broad range of industries;
dynamic, results-oriented and hands-on people to efficiently deliver solutions;
inquisitive, science-oriented people who apt at formulating hypotheses;
people willing to learn new tools or skills;
people with strong interpersonal and communication skills; and
people who share our core values of impact, accountability, leadership, integrity and collaboration.
Under the direction of the team leader of Data Analytics Services in the Digital Technologies Research Centre, the incumbents will plan, manage, and carry out data analysis in the areas of value to NRC clients.

Screening criteria
Applicants must demonstrate within the content of their application that they meet the following screening criteria in order to be given further consideration as candidates:

Education
Master’s degree in statistics, computer science, engineering, or closely related field;
A Bachelor’s degree in statistics, mathematics or engineering with experience with data processing and analysis could be considered.
Preference will be given to candidates with specialized training in machine learning, data science or statistics.
Experience
Experience in the capture, cleaning, processing and analysis of data for the use of various machine learning and statistical methods.
Experience in at least one of these programming languages: R, Python, Java or C/C++.
Asset: Experience in data visualization software and techniques (such as Shiny, ggplot, matplotlib, D3, Tableau).
Asset: Hands-on experience of large-scale data sets (big data). 
Asset: Experience working with distributed computing tools (MapReduce, Hadoop, Hive, Spark, etc.).
 

Condition of employment
Reliability Status
Language requirements
One bilingual imperative CBC/CBC position and one English position.
Information on language requirements and self-assessment tests
Assessment criteria
Candidates will be assessed on the basis of the following criteria:

Technical competencies:
Strong knowledge of statistical methods and machine learning techniques.
Basic knowledge of linear algebra and optimization techniques, such as gradient descent.
Basic knowledge of SQL Databases (such as Oracle, SQL Server, MySQL), NoSQL Databases (such as MongoDB, Cassandra, Redis) and Graph Databases (such as OrientDB, Neo4j).
Knowledge of algorithms.
Basic knowledge of information acquisition using Application Programming Interface (API).
Fluent with at least one statistical language or package, such as R, S-Plus, SAS, MATLAB, Octave or Python (Pandas, SciPy/NumPy, sckikit-learn).
 

Behavioural competencies:
From Management Services:

Communication (Level 2)
Results Orientation (Level 2)
Teamwork (Level 2)
From Research:
 

Creative thinking (Level 3)
Continuous professional learning (Level 2)
 

For this position, the NRC will evaluate candidates using the following competency profile(s): | Management Services | Research

View all competency profiles.

Relocation
Relocation assistance will be determined in accordance with NRC directives.

Salary range
From $49,670 to $140,418 per annum.
These positions are classified as a Research Council Officer (RCO), a group that is unique to the NRC. The RCO group uses a person-based classification system instead of the more common duties-based classification system. Candidates are remunerated based on their expertise, skill, outcomes and impacts of their previous work experience. The salary scale for this group is vast, from $49,670 to $140,418 per annum, which permits for employees of all levels from new graduates to world renowned experts to be fairly compensated for their contributions.
Closing date
12/06/2017 (5 days)

Applications will be accepted until 23:59 Eastern Time
", 
"jobLink":"http://careers-carrieres.nrc-cnrc.gc.ca/careers/jobpost.nsf/EnglishAll/0E6BC9A92FCED3F4852581D30069D165", 
"jobTitle":"National Research Council Canada - Data Scientist"}

]